#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/businesscompanyllc/businesscompanyllc-github/runs/run-nwyn7B3E9BA3ktWS

Waiting for the plan to start...

Terraform v1.0.10
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_membership.user_0: Refreshing state... [id=businesscompanyllc:kdmccormick]
github_membership.user_1: Refreshing state... [id=businesscompanyllc:sarina]
github_team.organization_managers: Refreshing state... [id=5308184]
module.repository_innovation_plugin.github_repository.this: Refreshing state... [id=innovation-plugin]
module.repository_core_platform.github_repository.this: Refreshing state... [id=core-platform]
github_team_membership.membership_for_user_1: Refreshing state... [id=5308184:sarina]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team.organization_managers has been changed
  ~ resource "github_team" "organization_managers" {
      ~ etag                      = "W/\"0059e0b1e71a8338ca2d10d4924ffe60e21f3ec38114273e328b10dd363a0894\"" -> "W/\"a09a41607aa08dd1fb64fd2eabd4d7323bfec6abdde4f146171b045061efa5e7\""
        id                        = "5308184"
        name                      = "organization-managers"
        # (6 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.repository_core_platform.github_repository.this will be destroyed
  - resource "github_repository" "this" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = false -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Some core platform code and stuff" -> null
      - etag                   = "W/\"15303d31f4727a403c5b71a87f910e5b28aba0e3442efcb099ccc92dd2730980\"" -> null
      - full_name              = "businesscompanyllc/core-platform" -> null
      - git_clone_url          = "git://github.com/businesscompanyllc/core-platform.git" -> null
      - has_downloads          = false -> null
      - has_issues             = false -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/businesscompanyllc/core-platform" -> null
      - http_clone_url         = "https://github.com/businesscompanyllc/core-platform.git" -> null
      - id                     = "core-platform" -> null
      - is_template            = false -> null
      - name                   = "core-platform" -> null
      - node_id                = "R_kgDOGUCXYQ" -> null
      - private                = false -> null
      - repo_id                = 423663457 -> null
      - ssh_clone_url          = "git@github.com:businesscompanyllc/core-platform.git" -> null
      - svn_url                = "https://github.com/businesscompanyllc/core-platform" -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # module.repository_github_configuration.github_branch.master will be created
  + resource "github_branch" "master" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "github-configuration"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repository_github_configuration.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "github-configuration"
    }

  # module.repository_github_configuration.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "Terraform",
            ]
          + strict   = false
        }
    }

  # module.repository_github_configuration.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "GitHub organization configuration-as-code, includinging permissions, teams, and repositories."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "github-configuration"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repository_innovation_plugin.github_repository.this will be destroyed
  - resource "github_repository" "this" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = false -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = true -> null
      - description            = "A core platform plugin to inspire synergistic acceleration alignment" -> null
      - etag                   = "W/\"9c9f8f10b4a0a5ddaee86c71ea564d80239d99d6fad356fb36111c85afd8a915\"" -> null
      - full_name              = "businesscompanyllc/innovation-plugin" -> null
      - git_clone_url          = "git://github.com/businesscompanyllc/innovation-plugin.git" -> null
      - has_downloads          = false -> null
      - has_issues             = false -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/businesscompanyllc/innovation-plugin" -> null
      - http_clone_url         = "https://github.com/businesscompanyllc/innovation-plugin.git" -> null
      - id                     = "innovation-plugin" -> null
      - is_template            = false -> null
      - name                   = "innovation-plugin" -> null
      - node_id                = "R_kgDOGUCXVg" -> null
      - private                = false -> null
      - repo_id                = 423663446 -> null
      - ssh_clone_url          = "git@github.com:businesscompanyllc/innovation-plugin.git" -> null
      - svn_url                = "https://github.com/businesscompanyllc/innovation-plugin" -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

Plan: 4 to add, 0 to change, 2 to destroy.


```

</details>

*Pusher: @kdmccormick, Action: `pull_request`*